Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If the declared return type of the interface method is a primitive type, then the value returned by this method must be an instance of the corresponding primitive wrapper class; otherwise, it must be a type assignable to the declared return type.
zh_cn: 如果接口方法的声明返回类型是基本类型，则此方法返回的值一定是相应基本包装对象类的实例；否则，它一定是可分配到声明返回类型的类型。

source: If the execution point is contained in an instance or class initializer, this method will return the appropriate special method name, <init> or <clinit>, as per Section 3.9 of The Java Virtual Machine Specification.
zh_cn: 如果执行点包含在某个实例或类初始化程序中，则此方法将返回适当的特殊方法名：<init> 或 <clinit>（根据 The Java Virtual Machine Specification 中的第 3.9 节）。

source: If the garbage collector determines at a certain point in time that the referent of a phantom reference is phantom reachable, then at that time or at some later time it will enqueue the reference.
zh_cn: 如果垃圾回收器确定在某一特定时间点上虚引用的指示对象是虚可到达对象，那么在那时或者在以后的某一时间，它会将该引用加入队列。

source: If the initial capacity is greater than the maximum number of entries divided by the load factor, no rehash operations will ever occur.
zh_cn: 如果初始容量大于最大条目数除以加载因子，则不会发生 rehash 操作。

source: If the internal buffer overflows, it is automatically made larger.
zh_cn: 如果内部缓冲区溢出，则此容量自动增大。

source: If the length of the specified CharSequence is less than or equal to zero, then an empty buffer of capacity 16 is returned.
zh_cn: 如果指定的 CharSequence 的长度小于或等于 0，则返回容量为 16 的空缓冲区。

source: If the map is modified while an iteration over the collection is in progress (except through the iterator's own remove operation), the results of the iteration are undefined.
zh_cn: 如果在对 collection 进行迭代的同时修改了映射（通过迭代器自己的 remove 操作除外），则迭代结果是不确定的。

source: If the map is modified while an iteration over the set is in progress (except through the iterator's own remove operation), the results of the iteration are undefined.
zh_cn: 如果在对 set 进行迭代的同时修改了映射（通过迭代器自己的 remove 操作除外），则迭代结果是不确定的。

source: If the map is modified while an iteration over the set is in progress (except through the iterator's own remove operation, or through the setValue operation on a map entry returned by the iterator) the results of the iteration are undefined.
zh_cn: 如果在对 set 进行迭代的同时修改了映射（通过迭代器自己的 remove 操作，或者通过在该迭代器返回的映射项上执行 setValue 操作除外），则迭代结果是不确定的。

source: If the map previously contained a mapping for the key, the old value is replaced.
zh_cn: 如果该映射以前包含了一个该键的映射关系，则旧值被替换。

source: If the pool becomes more active later, new threads will be constructed.
zh_cn: 如果池后来变得更为活动，则可以创建新的线程。

source: If the pool currently has more than corePoolSize threads, excess threads will be terminated if they have been idle for more than the keepAliveTime (see getKeepAliveTime(TimeUnit)).
zh_cn: 如果池中当前有多于 corePoolSize 的线程，则这些多出的线程在空闲时间超过 keepAliveTime 时将会终止（参见 getKeepAliveTime(TimeUnit)）。

source: If the return type of any of the methods is a primitive type or void, then all of the methods must have that same return type.
zh_cn: 如果任何方法的返回类型是基本类型或 void，那么所有的方法必须具有与此相同的返回类型。

source: If the returned array is of non-zero length then the first element of the array represents the top of the stack, which is the most recent method invocation in the sequence.
zh_cn: 若返回的数组不是长度为 0 的数组，则其第一个元素代表堆栈顶，它是该序列中最新的方法调用。

source: If the sequence is mutated while the stream is being read, the result is undefined.
zh_cn: 如果序列在读取流时发生变异，则结果未定义。

source: If the specified index argument is negative, or if it is greater than or equal to the length of the specified array
zh_cn: 如果 index 参数为负，或者它大于等于指定数组的长度

source: If the specified key is not already associated with a value (or is mapped to null) associates it with the given value and returns null, else returns the current value.
zh_cn: 如果指定的键尚未与值关联(或映射到 null)，则将其与给定值关联并返回 null，否则返回当前值。

source: If the specified key is not already associated with a value (or is mapped to null), attempts to compute its value using the given mapping function and enters it into this map unless null.
zh_cn: 如果指定的键尚未与值关联(或映射到 null)，则尝试使用给定的映射函数计算其值并将其输入此映射，除非 null。

source: If the specified key is not already associated with a value or is associated with null, associates it with the given non-null value.
zh_cn: 如果指定的键尚未与值关联或与 null 关联，请将其与给定的非 null 值关联。

source: If the specified object is not an array
zh_cn: 如果指定对象不是一个数组

source: If the specified object is not an array, or if the indexed element cannot be converted to the return type by an identity or widening conversion
zh_cn: 如果指定对象不是一个数组，或者无法通过一个恒等或扩展转换将索引元素转换为返回类型

source: If the specified object is null
zh_cn: 如果指定对象为 null

source: If the subprocess has not yet terminated, the calling thread will be blocked until the subprocess exits.
zh_cn: 如果没有终止该子进程，调用的线程将被阻塞，直到退出子进程。

source: If the system does not support environment variables, an empty map is returned.
zh_cn: 如果系统不支持环境变量，将返回空映射。

source: If the target thread held a lock protecting a critical system resource when it was destroyed, no thread could ever access this resource again.
zh_cn: 如果目标线程被破坏时保持一个保护关键系统资源的锁，则任何线程在任何时候都无法再次访问该资源。

source: If the target thread holds a lock on the monitor protecting a critical system resource when it is suspended, no thread can access this resource until the target thread is resumed.
zh_cn: 如果目标线程在监视器上持有一个锁，以在挂起关键系统资源时保护该资源，则在恢复目标线程之前，任何线程都无法访问该资源。

source: If the target thread waits for long periods (on a condition variable, for example), the interrupt method should be used to interrupt the wait.
zh_cn: 如果目标线程等待很长时间(例如，在条件变量上)，则应使用 interrupt 方法来中断等待。

source: If the thread that would resume the target thread attempts to lock this monitor prior to calling resume, deadlock results.
zh_cn: 如果要恢复目标线程的线程在调用 resume 之前试图锁定此监视器，则会导致死锁。

source: If the value for the specified key is present and non-null, attempts to compute a new mapping given the key and its current mapped value.
zh_cn: 如果指定键的值存在且不为空，则尝试计算给定键及其当前映射值的新映射。

source: If the value returned by this method is null and the interface method's return type is primitive, then a NullPointerException will be thrown by the method invocation on the proxy instance.
zh_cn: 如果此方法返回的值为 null 并且接口方法的返回类型是基本类型，则代理实例上的方法调用将抛出 NullPointerException。

source: If the value returned by this method is otherwise not compatible with the interface method's declared return type as described above, a ClassCastException will be thrown by the method invocation on the proxy instance.
zh_cn: 否则，如果此方法返回的值与上述接口方法的声明返回类型不兼容，则代理实例上的方法调用将抛出 ClassCastException。

source: If the variable has no value for the current thread, it is first initialized to the value returned by an invocation of the initialValue() method.
zh_cn: 如果变量没有用于当前线程的值，则先将其初始化为调用 initialValue() 方法返回的值。

source: If there are any surrogate pairs included in the sequence, these are treated as single characters for the reverse operation.
zh_cn: 如果序列中存在代理项对 (surrogate pair)，在 reverse 操作中将其作为单个字符处理。

source: If there are more than corePoolSize but less than maximumPoolSize threads running, a new thread will be created only if the queue is full.
zh_cn: 如果运行的线程多于 corePoolSize 而少于 maximumPoolSize，则仅当队列满时才创建新线程。

source: If there is a security manager, and this thread is not the current thread, then the security manager's checkPermission method is called with a RuntimePermission("getStackTrace") permission to see if it's ok to get the stack trace.
zh_cn: 如果有安全管理器，并且该线程不是当前线程，则通过 RuntimePermission("getStackTrace") 权限调用安全管理器的 checkPermission 方法，查看是否可以获取堆栈跟踪。

source: If there is a security manager, its checkCreateClassLoader method is invoked.
zh_cn: 如果存在安全管理器，则调用其 checkCreateClassLoader 方法。

source: If there is a security manager, its checkAccess method is invoked with the ThreadGroup as its argument.
zh_cn: 如果有安全管理器，则调用其 checkAccess 方法，并将该线程作为其参数。

source: If there is a security manager, its checkExec method is called with the first component of this object's command array as its argument.
zh_cn: 如果有安全管理器，则用此对象的 command 数组的首个元素作为其参数来调用安全管理器的 checkExec 方法。

source: If there is a security manager, its checkAccess method is called with this thread as its argument.
zh_cn: 如果有安全管理器，则调用其 checkAccess 方法，并将该线程作为其参数。

source: If this Class object represents a local or anonymous class within a constructor, returns a Constructor object representing the immediately enclosing constructor of the underlying class.
zh_cn: 如果该 Class 对象表示构造方法中的一个本地或匿名类，则返回 Constructor 对象，它表示底层类的立即封闭构造方法。

source: If this Class object represents a local or anonymous class within a method, returns a Method object representing the immediately enclosing method of the underlying class.
zh_cn: 如果此 Class 对象表示某一方法中的一个本地或匿名类，则返回 Method 对象，它表示底层类的立即封闭方法。

source: If this property is true, then any error output generated by subprocesses subsequently started by this object's start() method will be merged with the standard output, so that both can be read using the getInputStream() method.
zh_cn: 如果此属性为 true，则任何由通过此对象的 start() 方法启动的后续子进程生成的错误输出都将与标准输出合并，因此两者均可使用 getInputStream() 方法读取。

source: If this reference object has been cleared, either by the program or by the garbage collector, then this method returns null.
zh_cn: 如果此引用对象已经由程序或垃圾回收器清除，则此方法将返回 null。

source: If this reference object was not registered with a queue when it was created, then this method will always return false.
zh_cn: 如果创建此引用对象时没有在队列中注册它，则该方法将总是返回 false。

source: If this thread was constructed using a separate Runnable run object, then that Runnable object's run method is called; otherwise, this method does nothing and returns.
zh_cn: 如果该线程是使用独立的 Runnable 运行对象构造的，则调用该 Runnable 对象的 run 方法；否则，该方法不执行任何操作并返回。

source: If this thread-local variable is subsequently read by the current thread, its value will be reinitialized by invoking its initialValue() method, unless its value is set by the current thread in the interim.
zh_cn: 如果此线程局部变量随后被当前线程读取，且这期间当前线程没有设置其值，则将调用其 >initialValue() 方法重新初始化其值。

source: If this type is a top-level type, null is returned.
zh_cn: 如果此类型为顶层类型，则返回 null。

source: If this type is a top-level type, null is returned
zh_cn: 如果此类型是顶层类型，则返回 null

source: If two objects are equal according to the equals(Object) method, then calling the hashCode method on each of the two objects must produce the same integer result.
zh_cn: 如果根据 equals(Object) 方法，两个对象是相等的，那么对这两个对象中的每个对象调用 hashCode 方法都必须生成相同的整数结果。

source: If worker threads or other threads using the pool do not possess this permission, service may be degraded: configuration changes may not take effect in a timely manner, and a shutdown pool may remain in a state in which termination is possible but not completed.
zh_cn: 如果工作线程或使用池的其他线程不具有此权限，则服务可能会降级：配置更改可能不会及时生效，关闭池可能仍处于可以终止但未完成的状态。

source: If you would like to ensure that unreferenced pools are reclaimed even if users forget to call shutdown(), then you must arrange that unused threads eventually die, by setting appropriate keep-alive times, using a lower bound of zero core threads and/or setting allowCoreThreadTimeOut(boolean).
zh_cn: 如果希望确保回收取消引用的池（即使用户忘记调用 shutdown()），则必须安排未使用的线程最终终止：设置适当保持活动时间，使用 0 核心线程的下边界和/或设置 allowCoreThreadTimeOut(boolean)。

source: Ignoring variance, the expected occurrences of list size k are (exp(-0.5) * pow(0.5, k) / factorial(k)).
zh_cn: 忽略变动，大小为 k 的列表的预期出现为 (exp(-0.5) * pow(0.5, k) / factorial(k))，前几个值为：

source: Immutable objects describing settings such as rounding mode and digit precision for the numerical operations provided by class BigDecimal.
zh_cn: 描述由 BigDecimal 类提供的数值运算的舍入模式和数字精度等设置的不可变对象。

source: Implementation note: It is a good idea for the returned input stream to be buffered.
zh_cn: 实现注意事项：对返回的输入流进行缓冲是一个好主意。

source: Implementation note: It is a good idea for the returned output stream to be buffered.
zh_cn: 实现注意事项：对返回的输出流进行缓冲是一个好主意。

source: Implementation note: The implementations of the "bit twiddling" methods (such as highestOneBit and numberOfTrailingZeros) are based on material from Henry S. Warren, Jr.'s Hacker's Delight, (Addison Wesley, 2002).
zh_cn: 实现注意事项："bit twiddling" 方法（如 highestOneBit 和 numberOfTrailingZeros）的实现基于 Henry S. Warren 和 Jr. 撰写的 Hacker's Delight (Addison Wesley, 2002) 一书中的资料。

source: Implementation notes.
zh_cn: 实现说明。

source: Implementations make a "best effort" to detect time-outs as soon as possible after they occur.
zh_cn: 在超时发生后，实现会“尽力”检测超时。

source: Implementing this interface allows an object to be the target of the "for-each loop" statement.
zh_cn: 实现这个接口允许对象成为 "for-each 循环" 语句的目标。

source: Implements Map.get and related methods
zh_cn: 实现 Map.get 和相关方法

source: Implements Map.put and related methods
zh_cn: 实现 Map.put 和相关的方法

source: Implements Map.putAll and Map constructor
zh_cn: 实现 Map.putAll 和 Map 构造函数

source: Implements Map.remove and related methods
zh_cn: 实现 Map.remove 和相关的方法

source: In ThreadPoolExecutor.CallerRunsPolicy, the thread that invokes execute itself runs the task.
zh_cn: 在 ThreadPoolExecutor.CallerRunsPolicy 中，线程调用运行该任务的 execute 本身。

source: In ThreadPoolExecutor.DiscardOldestPolicy, if the executor is not shut down, the task at the head of the work queue is dropped, and then execution is retried (which can fail again, causing this to be repeated.)
zh_cn: 在 ThreadPoolExecutor.DiscardOldestPolicy 中，如果执行程序尚未关闭，则位于工作队列头部的任务将被删除，然后重试执行程序（如果再次失败，则重复此过程）。

source: In ThreadPoolExecutor.DiscardPolicy, a task that cannot be executed is simply dropped.
zh_cn: 在 ThreadPoolExecutor.DiscardPolicy 中，不能执行的任务将被删除。

source: In addition to classes representing single values, this package contains Updater classes that can be used to obtain compareAndSet operations on any selected volatile field of any selected class.
zh_cn: 除了包含表示单个值的类之外，此包还包含 Updater 类，该类可用于获取任意选定类的任意选定 volatile 字段上的 compareAndSet 操作。

source: In addition to its content a buffer has a position, which is the index of the next element to be read or written, and a limit, which is the index of the first element that should not be read or written.
zh_cn: 除内容之外，缓冲区还具有 位置 和 界限，其中位置是要读写的下一个元素的索引，界限是第一个应该读写的元素的索引。

source: In addition, Runnable provides the means for a class to be active while not subclassing Thread.
zh_cn: 此外，Runnable 为非 Thread 子类的类提供了一种激活方式。

source: In addition, a thread group can also include other thread groups.
zh_cn: 此外，线程组也可以包含其他线程组。

source: In addition, this class provides many methods for converting a boolean to a String and a String to a boolean, as well as other constants and methods useful when dealing with a boolean.
zh_cn: 此外，该类提供了多个方法，可以将 boolean 转换为 String，将 String 转换为 boolean，除此之外，还提供了其他一些处理 boolean 时有用的常量和方法。

source: In addition, this class provides several methods for converting a byte to a String and a String to a byte, as well as other constants and methods useful when dealing with a byte.
zh_cn: 此外，该类还提供了 byte 到 String 和 String 到 byte 的几种转换方法，并提供了处理 byte 时非常有用的其他一些常量和方法。

source: In addition, this class provides several methods for converting a double to a String and a String to a double, as well as other constants and methods useful when dealing with a double.
zh_cn: 此外，该类提供了多个方法，可以将 double 转换为 String，将 String 转换为 double，除此之外，还提供了其他一些处理 double 时有用的常量和方法。

source: In addition, this class provides several methods for converting a float to a String and a String to a float, as well as other constants and methods useful when dealing with a float.
zh_cn: 此外，该类提供了多个方法，可以将 float 转换为 String，将 String 转换为 float，除此之外，还提供了其他一些处理 float 时有用的常量和方法。

source: In addition, this class provides several methods for converting a long to a String and a String to a long, as well as other constants and methods useful when dealing with a long.
zh_cn: 此外，该类提供了多个方法，可以将 long 转换为 String，将 String 转换为 long，除此之外，还提供了其他一些处理 long 时有用的常量和方法。

source: In addition, this class provides several methods for converting a short to a String and a String to a short, as well as other constants and methods useful when dealing with a short.
zh_cn: 另外，该类提供了多个方法，可以将 short 转换为 String，将 String 转换为 short，同时还提供了其他一些处理 short 时有用的常量和方法。

source: In addition, this class provides several methods for converting an int to a String and a String to an int, as well as other constants and methods useful when dealing with an int.
zh_cn: 另外，该类提供了多个方法，可以将 int 转换为 String，将 String 转换为 int，同时还提供了其他一些处理 int 时有用的常量和方法。

source: In addition, this class provides several methods for determining a character's category (lowercase letter, digit, etc.) and for converting characters from uppercase to lowercase and vice versa.
zh_cn: 此外，该类提供了几种方法，以确定字符的类别（小写字母，数字，等等），并将字符从大写转换成小写，反之亦然。

source: In all cases that time-outs are used, the time-out specifies the minimum time that the method should wait before indicating that it timed-out.
zh_cn: 在使用超时的所有情况中，超时指定了在表明已超时前该方法应该等待的最少时间。

source: In all other respects, this method does the same thing as the method wait(long) of one argument.
zh_cn: 在其他所有方面，此方法执行的操作与带有一个参数的 wait(long) 方法相同。

source: In either case, the execute method invokes the rejectedExecution(Runnable, ThreadPoolExecutor) method of its RejectedExecutionHandler.
zh_cn: 在以上两种情况下，execute 方法都将调用其 RejectedExecutionHandler 的 rejectedExecution(Runnable, ThreadPoolExecutor) 方法。

source: In environments in which the delegation model is not strictly hierarchical, class loaders need to be parallel capable, otherwise class loading can lead to deadlocks because the loader lock is held for the duration of the class loading process (see loadClass methods).
zh_cn: 在委托模型不严格分层的环境中，类装入器需要具有并行能力，否则类装入可能导致死锁，因为装入器锁在类装入过程的持续时间内保持(请参见 loadClass 方法)。

source: In essence, the classes in this package extend the notion of volatile values, fields, and array elements to those that also provide an atomic conditional update operation of the form:
zh_cn: 事实上，此包中的类可将 volatile 值、字段和数组元素的概念扩展到那些也提供原子条件更新操作的类，其形式如下：

source: In general, if sb refers to an instance of a StringBuffer, then sb.append(x) has the same effect as sb.insert(sb.length(), x).
zh_cn: 通常，如果 sb 引用 StringBuilder 的一个实例，则 sb.append(x) 和 sb.insert(sb.length(), x) 具有相同的效果。

source: In general, if sb refers to an instance of a StringBuilder, then sb.append(x) has the same effect as sb.insert(sb.length(), x).
zh_cn: 通常，如果 sb 引用 StringBuilder 的实例，则 sb.append(x) 和 sb.insert(sb.length(), x) 具有相同的效果。

source: In general, the toString method returns a string that "textually represents" this object.
zh_cn: 通常，toString 方法会返回一个“以文本方式表示”此对象的字符串。

source: In most cases, the Runnable interface should be used if you are only planning to override the run() method and no other Thread methods.
zh_cn: 大多数情况下，如果只想重写 run() 方法，而不重写其他 Thread 方法，那么应使用 Runnable 接口。

source: In order to ensure that a reclaimable object remains so, the referent of a phantom reference may not be retrieved: The get method of a phantom reference always returns null.
zh_cn: 为了确保可回收的对象仍然保持原状，虚引用的指示对象不能被获取：虚引用的 get 方法总是返回 null。

source: In other cases in which multiple threads are expected to access a common collection, "concurrent" versions are normally preferable.
zh_cn: 在期望多个线程访问公共 collection 的其他情况中，通常“并发”版本要更好一些。

source: In other words, for class loader cl and every interface i, the following expression must be true:
zh_cn: 换句话说，对于类加载器 cl 和所有接口 i，以下表达式必须为 true：

source: In other words, if the newLength argument is less than the current length, the length is changed to the specified length.
zh_cn: 换句话说，如果 newLength 参数小于当前长度，则长度将更改为指定的长度。

source: In other words, returns true if the specified object is an instance of the same annotation type as this instance, all of whose members are equal to the corresponding member of this annotation, as defined below:
zh_cn: 换句话说，如果指定对象是一个与此实例相同的 annotation 类型的实例，即其所有成员都与此实例中所对应的成员相等，则返回 true，具体说明如下：

source: In other words, the public, non-final methods of java.lang.Object logically precede all of the proxy interfaces for the determination of which Method object to pass to the invocation handler.
zh_cn: 换句话说，java.lang.Object 公共的非最终方法理论上在所有代理接口之前，以便确定哪一个 Method 对象传递到调用处理程序。

source: In other words, this method behaves exactly as if it simply performs the call wait(0).
zh_cn: 换句话说，此方法的行为就好像它仅执行 wait(0) 调用一样。

source: In other words, this method returns a string equal to the value of:
zh_cn: 换句话说，该方法返回一个字符串，它的值等于：

source: In other words, waits should always occur in loops, like this one:
zh_cn: 换句话说，等待应总是发生在循环中，如下面的示例：

source: In particular, wait(0, 0) means the same thing as wait(0).
zh_cn: 需要特别指出的是，wait(0, 0) 与 wait(0) 相同。

source: In particular, a thread may not be restarted once it has completed execution.
zh_cn: 特别是当线程已经结束执行后，不能再重新启动。

source: In particular, multiple Condition objects may be associated with a single Lock.
zh_cn: 需要特别指出的是，单个 Lock 可能与多个 Condition 对象关联。

source: In particular, such a sorted set (or sorted map) violates the general contract for set (or map), which is defined in terms of the equals method.
zh_cn: 尤其是，这样的有序集合（或有序映射表）违背了根据 equals 方法定义的集合（或映射表）的常规协定。

source: In particular:
zh_cn: 尤其是：

source: In practice, soft references are inefficient for caching.
zh_cn: 实际上，软引用对于缓存是低效的。

source: In some systems, the name may refer to some source code unit other than a file, such as an entry in source repository.
zh_cn: 在某些系统中，该名称可能指的是源代码单元而不是某个文件，如源存储库中的某个项。

source: In such cases an exception will be thrown.
zh_cn: 在这些情况中将会抛出一个异常。

source: In the Java SE API documentation, Unicode code point is used for character values in the range between U+0000 and U+10FFFF, and Unicode code unit is used for 16-bit char values that are code units of the UTF-16 encoding.
zh_cn: 在 Java SE API 文档中，Unicode 代码点 用于范围在 U+0000 与 U+10FFFF 之间的字符值，而 Unicode 代码点 用于作为 UTF-16 编码的代码单元的 16 位 char 值。

source: In the case where IPv6 is not available, or explicitly disabled, Inet6Address are not valid arguments for most networking operations any more.
zh_cn: 在 IPv6 不可用或被显式禁用的情况下，Inet6Address 对大多数网络连接操作都不再是有效参数。

source: In the default ThreadPoolExecutor.AbortPolicy, the handler throws a runtime RejectedExecutionException upon rejection.
zh_cn: 在默认的 ThreadPoolExecutor.AbortPolicy 中，处理程序遭到拒绝将抛出运行时 RejectedExecutionException。

source: In the event of such a SecurityException, the accessibility of objects is set to flag for array elements upto (and excluding) the element for which the exception occurred; the accessibility of elements beyond (and including) the element for which the exception occurred is unchanged.
zh_cn: 如果发生 SecurityException，对于少于（不包括）发生异常的元素的数组元素，可以将对象的可访问性设置为 flag；对于超出（包括）引发异常的元素的那些元素，则不更改其可访问性。

source: In the extreme case, a virtual machine that has no stack trace information concerning this thread is permitted to return a zero-length array from this method.
zh_cn: 在极端情况下，没有该线程堆栈跟踪信息的虚拟机可以从该方法返回一个零长度数组。

source: In the foregoing description, the notation sgn(expression) designates the mathematical signum function, which is defined to return one of -1, 0, or 1 according to whether the value of expression is negative, zero or positive.
zh_cn: 在前面的描述中，符号 sgn(expression) 指定 signum 数学函数，该函数根据 expression 的值是负数、零还是正数，分别返回 -1、0 或 1 中的一个值。

source: In the particular case of ConcurrentHashMap, it safely permits any number of concurrent reads as well as a tunable number of concurrent writes.
zh_cn: 在 ConcurrentHashMap 这一特定情况下，它可以安全地允许进行任意数目的并发读取，以及数目可调的并发写入。

source: In this case, a zero length array is returned.
zh_cn: 在此情况下，将返回长度为零的数组。

source: In this case, the component type of the new array is the component type of componentType.
zh_cn: 在这种情况下，新数组的组件类型为 componentType 的组件类型。

source: In this representation, supplementary characters are represented as a pair of char values, the first from the high-surrogates range, (\uD800-\uDBFF), the second from the low-surrogates range (\uDC00-\uDFFF).
zh_cn: 在这种表现形式中，增补字符表示为一对 char 值，第一个值取自高代理项 范围，即 (\uD800-\uDBFF)，第二个值取自低代理项 范围，即 (\uDC00-\uDFFF)。

source: In those infrequent cases where you would like to do so, you can use an AtomicInteger to hold byte values, and cast appropriately.
zh_cn: 这种情况不常见，如果要这样做，可以使用 AtomicInteger 来保持 byte 值，并进行适当的强制转换。

source: In usages with well-distributed user hashCodes, tree bins are rarely used.
zh_cn: 在具有分布良好的用户散列码的使用中，很少使用 tree bins。
